# 수치 연산자
# 산술 연산자
print(8 * 3)      # 24      
print(8 + 3)     # 11 
print(8 - 3)      # 5 
print(8 / 3)      # 2.6666666666666665

# 나누기 연산자 : 결과는 실수형으로 나온다.
print(8 / 3)       # 2.6666666666666665 
print(8.0 / 3)     # 2.6666666666666665
print(8 / 3.0)     # 2.6666666666666665 
print(8.0 / 3.0)  # 2.6666666666666665
print(9 / 3)         # 3.0
print(9 / 3.0)      # 3.0
print('---------------------------------')
# 몫//, 나머지%, 지수** 연사자 
print(10//3)            # 3     몫 연산자
print(10%3)             # 1     나머지 연산자
print(divmod(10, 3))    # (3,1) 몫 과 나머지를 구하는 함수 
print(8**2)             # 64    8의 2승

# 지수** 연산자

print((2 ** 3) ** 4)
print(2 ** 3 ** 4) #  == 2 ** (3 ** 4)
print(2 ** (3 ** 4 ))

