#형변환 내장함수 list(), tuple(), set()를 사용해서 서로 변환이 가능하다.

t = (1, 2, 3)               # 튜플 : 읽기 전용
print(t, type(t))
# t[1] = 100                # 변경 안됨 : 튜플확인

a_list = list(t)            # list로 형변환
print(a_list, type(a_list)) # [1, 2, 3] <class 'list'>

# list --> tuple =================================================================
print("================================================================")
a = [1, 2, 3]
a[1] = 999
print(a, type(a))

t_tuple = tuple(a)
print(t_tuple, type(t_tuple))            # (1, 2, 3) <class 'tuple'>

# tuple --> set ==================================================================
print("================================================================")
t = (1, 2, 3, 1, 3, 2)
print(t, type(t))
s_set = set(t)
print(s_set, type(s_set))